isliulin/Smart-energy-storage-system/PCU4Unify/BSP/STM32F107_BSP_I2c.c

#include "STM32F107_BSP_io.h"


/*
* 函数名：BSP_GPIO_Init
* 描述	：初始化
* 输入	：void
* 输出	: void
*/

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_i2c.h"
#include "STM32F107_BSP_I2c.h"
#include "STM32F107_BSP_timer.h"
#include <stdio.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define I2C_Speed              200000
#define I2C1_SLAVE_ADDRESS7    0xA0
#define I2C_PageSize           128

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
static void GPIO_Config(void);
static void I2C_Config(void);
static void EEWP_DISABLE(void);
static void EEWP_DISABLE(void);
static void I2C_EepromWaitEepromStandbyState(u8 chipsel);

//static u16 HexToBCD(u16 Input);
//static u16 BCDToHex(u16 Input);
static void vStartRTC(void);
static u8 BSP_I2C_RTC_Read (u8 address);
static void BSP_I2C_RTC_Write (u8 address, u8 data);


 _CALENDAR  Calendar;

/*******************************************************************************
* Function Name  : void Delay_us(UINT32 delay_count)
* Description    : delay--ms
* Input          : UINT32 delay_count 6000=1mS @48MHz
* Output         : None
* Return         : None
*******************************************************************************/

void Delay_10us(u16 delay_count)
{
	volatile	u16 i,j;
	for (i=0; i< delay_count; i++)
	{
		for (j=0; j<100; j++);
	}
}

/* Private functions ---------------------------------------------------------*/
/*******************************************************************************
* Function Name  : GPIO_Configuration
* Description    : Configure the used I/O ports pin
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GPIO_Config(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure; 

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2,ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB|RCC_APB2Periph_GPIOE,ENABLE);


  
  /* Configure I2C2 pins: SCL and SDA */
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_10 | GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  //WP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOE, &GPIO_InitStructure);

  EEWP_DISABLE();			//写保护
}

/*******************************************************************************
* Function Name  : I2C_Configuration
* Description    : I2C Configuration
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void I2C_Config(void)
{
  I2C_InitTypeDef  I2C_InitStructure; 

  /* I2C configuration */
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x00;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = I2C_Speed;
  
  /* Apply I2C configuration after enabling it */
  I2C_Init(I2C2, &I2C_InitStructure);

  /* I2C Peripheral Enable */
  I2C_Cmd(I2C2, ENABLE);
    
  //printf("\n\r I2C_Configuration----\n\r");
    
}

/*******************************************************************************
* Function Name  : I2C_EE_Init
* Description    : Initializes peripherals used by the I2C EEPROM driver.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void BSP_I2C_EepromInit()
{
  // GPIO configuration 
  GPIO_Config();

  // I2C configuration 
  I2C_Config();

  /* depending on the EEPROM Address selected in the i2c_ee.h file */

}

/**-------------------------------------------------------
  * 函数名 void EEWP_EN(void)
  * 功能   EEPROM写保护打开
  * 参数   无
  * 返回值 无
***------------------------------------------------------*/
void EEWP_EN(void)
{  
   GPIOE->BRR |= 1<<15; 
}

/**-------------------------------------------------------
  * 函数名 void EEWP_DISABLE(void)
  * 功能   EEPROM写保护打开
  * 参数   无
  * 返回值 无
***------------------------------------------------------*/
void EEWP_DISABLE(void)
{
  GPIOE->BSRR |= 1<<15;  
}



/*******************************************************************************
* Function Name  : I2C_EE_BufferWrite
* Description    : Writes buffer of data to the I2C EEPROM.
* Input          : - pBuffer : pointer to the buffer  containing the data to be 
*                    written to the EEPROM.
*                  - WriteAddr : EEPROM's internal address to write to.
*                  - NumByteToWrite : number of bytes to write to the EEPROM.
* Output         : None
* Return         : None
*******************************************************************************/
void BSP_I2C_EepromBufferWrite(u8* pBuffer, u16 WriteAddr, u16 NumByteToWrite,u8 chipsel)
{
  u8 NumOfPage = 0, NumOfSingle = 0, Addr = 0, count = 0;


  
  Addr = WriteAddr % I2C_PageSize;  
  count = I2C_PageSize - Addr;		
  NumOfPage =  NumByteToWrite / I2C_PageSize;	
  NumOfSingle = NumByteToWrite % I2C_PageSize;	
 
  /* If WriteAddr is I2C_PageSize aligned  */
  if(Addr == 0) 
  {
    /* If NumByteToWrite < I2C_PageSize */
    if(NumOfPage == 0) 
    {
      BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, NumOfSingle,chipsel);
    }
    /* If NumByteToWrite > I2C_PageSize */
    else  
    {
      while(NumOfPage--)  //一次写128个数据
      {
        BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, I2C_PageSize,chipsel); 
        WriteAddr +=  I2C_PageSize;
        pBuffer += I2C_PageSize;
      }

      if(NumOfSingle!=0)	//除128个以外的
      {
        BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, NumOfSingle,chipsel);
      }
    }
  }
  /* If WriteAddr is not I2C_PageSize aligned  */
  else 
  {
    /* If NumByteToWrite < I2C_PageSize */
    if(NumOfPage== 0) 
    {
      BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, NumOfSingle,chipsel);
    }
    /* If NumByteToWrite > I2C_PageSize */
    else
    {
      NumByteToWrite -= count;
      NumOfPage =  NumByteToWrite / I2C_PageSize;
      NumOfSingle = NumByteToWrite % I2C_PageSize;	
      
      if(count != 0)
      {  
        BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, count,chipsel);
        WriteAddr += count;
        pBuffer += count;
      } 
      
      while(NumOfPage--)
      {
        BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, I2C_PageSize,chipsel);
        WriteAddr +=  I2C_PageSize;
        pBuffer += I2C_PageSize;  
      }
      if(NumOfSingle != 0)
      {
        BSP_I2C_EepromPageWrite(pBuffer, WriteAddr, NumOfSingle,chipsel); 
      }
    }
  }  
  

