isliulin/Smart-energy-storage-system/PCU4Unify/BSP/STM32F107_BSP_I2c.c
}

/*******************************************************************************
* Function Name  : I2C_EE_ByteWrite
* Description    : Writes one byte to the I2C EEPROM.
* Input          : - pBuffer : pointer to the buffer  containing the data to be 
*                    written to the EEPROM.
*                  - WriteAddr : EEPROM's internal address to write to.
* Output         : None
* Return         : None
*******************************************************************************/
void BSP_I2C_EepromByteWrite(u8* pBuffer, u16 WriteAddr,u8 chipsel)
{
	u16 EEPROM_ADDRESS,TimeCnt;

	if(chipsel == 0)
		{
		EEPROM_ADDRESS = EEPROM_Block0_ADDRESS;
		}
	else 
		{
		EEPROM_ADDRESS = EEPROM_Block1_ADDRESS;
		}

  /* Send STRAT condition */
  I2C_GenerateSTART(I2C2, ENABLE);

  /* Test on EV5 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;  

  /* Send EEPROM address for write */
  I2C_Send7bitAddress(I2C2, EEPROM_ADDRESS, I2C_Direction_Transmitter);
  
  /* Test on EV6 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++; 
      
  /* Send the EEPROM's internal address to write to */
  I2C_SendData(I2C2, (u8)(WriteAddr>>8));
  
  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;

    I2C_SendData(I2C2, (u8)(WriteAddr));
  
  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  

  /* Send the byte to be written */
  I2C_SendData(I2C2, *pBuffer); 
   
  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;

  EEWP_EN();
  Delay_10us(1);
  /* Send STOP condition */
  I2C_GenerateSTOP(I2C2, ENABLE);
  
  Delay_10us(1);
  EEWP_DISABLE();
 // I2C_EepromWaitEepromStandbyState(0);
}

/*******************************************************************************
* Function Name  : I2C_EE_PageWrite
* Description    : Writes more than one byte to the EEPROM with a single WRITE
*                  cycle. The number of byte can't exceed the EEPROM page size.
* Input          : - pBuffer : pointer to the buffer containing the data to be 
*                    written to the EEPROM.
*                  - WriteAddr : EEPROM's internal address to write to.
*                  - NumByteToWrite : number of bytes to write to the EEPROM.
* Output         : None
* Return         : None
*******************************************************************************/
void BSP_I2C_EepromPageWrite(u8* pBuffer, u16 WriteAddr, u8 NumByteToWrite,u8 chipsel)
{
	u16 EEPROM_ADDRESS,TimeCnt;

	if(chipsel == 0)
		{
		EEPROM_ADDRESS = EEPROM_Block0_ADDRESS;		//is the address right?
		}
	else 
		{
		EEPROM_ADDRESS = EEPROM_Block1_ADDRESS;
		}
   TimeCnt = 0;
   while((I2C_GetFlagStatus(I2C2, I2C_FLAG_BUSY))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++; // Added by Najoua 27/08/2008
    
  /* 发送启动条件 */
  I2C_GenerateSTART(I2C2, ENABLE);
  
  /* Test on EV5 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
  /* Send EEPROM address for write */
 
  I2C_Send7bitAddress(I2C2, EEPROM_ADDRESS, I2C_Direction_Transmitter);
  
  /* Test on EV6 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;

  /* Send the EEPROM's internal address to write to */    
  I2C_SendData(I2C2, (u8)(WriteAddr>>8));  

  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((! I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
    I2C_SendData(I2C2, (u8)(WriteAddr));  

  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((! I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;

  /* While there is data to be written */
  while(NumByteToWrite--)  
  {
    /* Send the current byte */
    I2C_SendData(I2C2, *pBuffer); 

    /* Point to the next byte to be written */
    pBuffer++; 
  
    /* Test on EV8 and clear it */
	TimeCnt = 0;
    while ((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  }
  EEWP_EN();
  Delay_10us(1);

  /* Send STOP condition */
  I2C_GenerateSTOP(I2C2, ENABLE);
  Delay_10us(1);
  EEWP_DISABLE();
//  I2C_EepromWaitEepromStandbyState(0);
}

/*******************************************************************************
* Function Name  : I2C_EE_BufferRead
* Description    : Reads a block of data from the EEPROM.
* Input          : - pBuffer : pointer to the buffer that receives the data read 
*                    from the EEPROM.
*                  - ReadAddr : EEPROM's internal address to read from.
*                  - NumByteToRead : number of bytes to read from the EEPROM.
* Output         : None
* Return         : None
*******************************************************************************/
void BSP_I2C_EepromBufferRead(u8* pBuffer, u16 ReadAddr, u16 NumByteToRead,u8 chipsel)
{  
	u16 EEPROM_ADDRESS,TimeCnt;
	
	if(chipsel == 0)
		{
		EEPROM_ADDRESS = EEPROM_Block0_ADDRESS;
		}
	else 
		{
		EEPROM_ADDRESS = EEPROM_Block1_ADDRESS;
		}

  //*((u8 *)0x4001080c) |=0x80; 
    TimeCnt = 0;
    while((I2C_GetFlagStatus(I2C2, I2C_FLAG_BUSY))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++; // Added by Najoua 27/08/2008
    
    
  /* Send START condition */
  I2C_GenerateSTART(I2C2, ENABLE);
  //*((u8 *)0x4001080c) &=~0x80;
  
  /* Test on EV5 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;

  /* Send EEPROM address for write */
  I2C_Send7bitAddress(I2C2, EEPROM_ADDRESS, I2C_Direction_Transmitter);

