isliulin/Smart-energy-storage-system/PCU4Unify/BSP/STM32F107_BSP_I2c.c
  /* Test on EV6 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
  /* Clear EV6 by setting again the PE bit */
  I2C_Cmd(I2C2, ENABLE);

  /* Send the EEPROM's internal address to write to */

  I2C_SendData(I2C2, (u8)(ReadAddr>>8));  

  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
    /* Send the EEPROM's internal address to write to */
  I2C_SendData(I2C2, (u8)(ReadAddr));  

  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
  /* Send STRAT condition a second time */  
  I2C_GenerateSTART(I2C2, ENABLE);
  
  /* Test on EV5 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
  /* Send EEPROM address for read */
  I2C_Send7bitAddress(I2C2, EEPROM_ADDRESS, I2C_Direction_Receiver);
  
  /* Test on EV6 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;
  
  /* While there is data to be read */
  while(NumByteToRead)  
  {
    if(NumByteToRead == 1)
    {
      /* Disable Acknowledgement */
      I2C_AcknowledgeConfig(I2C2, DISABLE);
      
      /* Send STOP Condition */
      I2C_GenerateSTOP(I2C2, ENABLE);
    }
#if 1	
//远龙解决方案
	TimeCnt = 0;
	
	/* Wait for the byte to be received */
	while((I2C_GetFlagStatus(I2C2, I2C_FLAG_RXNE) == RESET)&& (TimeCnt < IICWAITTimeOut)) TimeCnt++;

	if(TimeCnt >= IICWAITTimeOut){*pBuffer = 0xFF;return;}
	
	/* Read a byte from the EEPROM */
	*pBuffer = I2C_ReceiveData(I2C2);

	/* Point to the next location where the byte read will be saved */
	pBuffer++; 
		
	/* Decrement the read bytes counter */
	NumByteToRead--;  

	//end of yuan long's solution
#endif

#if 0
  /* Test on EV7 and clear it */
	 if(I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_RECEIVED))  
	 {		
	   /* Read a byte from the EEPROM */
	   *pBuffer = I2C_ReceiveData(I2C2);
  
	   /* Point to the next location where the byte read will be saved */
	   pBuffer++; 
	   
	   /* Decrement the read bytes counter */
	   NumByteToRead--;  
	   
	 } 
#endif

  }
  /* Enable Acknowledgement to be ready for another reception */
  I2C_AcknowledgeConfig(I2C2, ENABLE);

}

/*******************************************************************************
* Function Name  : I2C_EepromWaitEepromStandbyState
* Description    : Wait for EEPROM Standby state
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void I2C_EepromWaitEepromStandbyState(u8 chipsel)      
{
  vu16 SR1_Tmp = 0;
  u16 EEPROM_ADDRESS,TimeCnt;
  if(chipsel == 0)
          {
          EEPROM_ADDRESS = EEPROM_Block0_ADDRESS;
          }
  else 
          {
          EEPROM_ADDRESS = EEPROM_Block1_ADDRESS;
          }
  do
  {
    /* Send START condition */
    I2C_GenerateSTART(I2C2, ENABLE);
    /* Read I2C1 SR1 register */
    SR1_Tmp = I2C_ReadRegister(I2C2, I2C_Register_SR1);
    /* Send EEPROM address for write */
    I2C_Send7bitAddress(I2C2, EEPROM_ADDRESS, I2C_Direction_Transmitter);
	TimeCnt++;
  }while((!(I2C_ReadRegister(I2C2, I2C_Register_SR1) & 0x0002))&& (TimeCnt < IICWAITTimeOut));
  
  /* Clear AF flag */
  I2C_ClearFlag(I2C2, I2C_FLAG_AF);
    /* STOP condition */    
    I2C_GenerateSTOP(I2C2, ENABLE); // Added by Najoua 27/08/2008
}

/*===========================================================================*
 *  函数名称：void BSP_I2C_RTC_Write (u8 address, u8 data)
 *  功能描述：写8563寄存器函数
 *  用法说明：
 *  输入参数：address--寄存器地址  data--寄存器数据
 *  输出参数：
 *  设计人员：
 *  创建日期：
 *==========================================================================*/

void BSP_I2C_RTC_Write (u8 address, u8 data)
{
	 u16 TimeCnt;
	 TimeCnt = 0;
	 while((I2C_GetFlagStatus(I2C2, I2C_FLAG_BUSY))&& (TimeCnt < IICWAITTimeOut))TimeCnt++; 

	  /* Send STRAT condition */
	  I2C_GenerateSTART(I2C2, ENABLE);
	
	  /* Test on EV5 and clear it */
	  TimeCnt = 0;
	  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;  
	
	  /* Send EEPROM address for write */
	  I2C_Send7bitAddress(I2C2, PCF8563_ADDRESS, I2C_Direction_Transmitter);
	  
	  /* Test on EV6 and clear it */
	  TimeCnt = 0;
	  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;
		  
	  /* Send the EEPROM's internal address to write to */
	  I2C_SendData(I2C2, address);
	  
	  /* Test on EV8 and clear it */
	  TimeCnt = 0;
	  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;
	
	  /* Send the byte to be written */
	  I2C_SendData(I2C2, data); 
	   
	  /* Test on EV8 and clear it */
	  TimeCnt = 0;
	  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;
	  
	  /* Send STOP condition */
	  I2C_GenerateSTOP(I2C2, ENABLE);


}


/*===========================================================================*
 *  函数名称：u8 BSP_I2C_RTC_Read (u8 address)
 *  功能描述：读取8563寄存器内容函数
 *  用法说明：
 *  输入参数：address--寄存器地址
 *  输出参数：
 *  设计人员：
 *  创建日期：
 *==========================================================================*/

u8 BSP_I2C_RTC_Read (u8 address)
{
	u8 ReceData;
	u16 TimeCnt = 0;
     //*((u8 *)0x4001080c) |=0x80; 
    while((I2C_GetFlagStatus(I2C2, I2C_FLAG_BUSY))&& (TimeCnt < IICWAITTimeOut))TimeCnt++; // Added by Najoua 27/08/2008
    
    
  /* Send START condition */
  I2C_GenerateSTART(I2C2, ENABLE);
  //*((u8 *)0x4001080c) &=~0x80;
  
  /* Test on EV5 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;

  /* Send EEPROM address for write */
  I2C_Send7bitAddress(I2C2, PCF8563_ADDRESS, I2C_Direction_Transmitter);

