isliulin/Smart-energy-storage-system/PCU4Unify/BSP/STM32F107_BSP_I2c.c
  /* Test on EV6 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;
  
  /* Clear EV6 by setting again the PE bit */
  I2C_Cmd(I2C2, ENABLE);

  /* Send the EEPROM's internal address to write to */
  I2C_SendData(I2C2, address);  

  /* Test on EV8 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;
  
  /* Send STRAT condition a second time */  
  I2C_GenerateSTART(I2C2, ENABLE);
  
  /* Test on EV5 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;
  
  /* Send EEPROM address for read */
  I2C_Send7bitAddress(I2C2, PCF8563_ADDRESS, I2C_Direction_Receiver);
  
  /* Test on EV6 and clear it */
  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;

  TimeCnt = 0;
  while((!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_RECEIVED))&& (TimeCnt < IICWAITTimeOut))TimeCnt++;

  ReceData = I2C_ReceiveData(I2C2);

  I2C_AcknowledgeConfig(I2C2, DISABLE);

  /* Send STOP Condition */
  I2C_GenerateSTOP(I2C2, ENABLE);

  return ReceData;
 

}



/*===========================================================================*
 *  函数名称：void vStartRTC(void)
 *  功能描述：启动RTC，设置RTC输出1024Hz信号
 *  用法说明：
 *  输入参数：
 *  输出参数：
 *  设计人员：
 *  创建日期：
 *==========================================================================*/
void vStartRTC(void)
{
	BSP_I2C_RTC_Write(CLKOUTCTLREG, 0x81);						// 输出1024Hz信号
	BSP_I2C_RTC_Write(CTLSTATUS1REG, 0);						// 启动时钟
}

/*===========================================================================*
 *  函数名称：Uint16 BCDToHex(Uint16 Input)
 *  功能描述：将BCD码转换为16进制数
 *  用法说明：
 *  输入参数：
 *  输出参数：
 *  设计人员：
 *  创建日期：
 *==========================================================================*/
u16 BCDToHex(u16  Input)
{
	return (Input & 0x0F) + (Input >> 4) * 10;
}

/*===========================================================================*
 *  函数名称：u16 HexToBCD(u16 Input)
 *  功能描述：将16进制数转换为BCD码
 *  用法说明：
 *  输入参数：
 *  输出参数：
 *  设计人员：
 *  创建日期：
 *==========================================================================*/
u16 HexToBCD(u16 Input)
{
	Input &= 0xFF;
	return (Input % 10) + (Input /10) * 16;
}
/*===========================================================================*
 函数名称：void ReadRTCTime(void)
 功能描述：从PCF8563读取时间
 输入参数：无
 返回值：无
 使用说明：
 *==========================================================================*/
void ReadRTCTime(void)
{

	u8 Time_Data;

//	if (g_st_TimerFlag.b1s != 1)
//	{
//		return;
//	}
	
	Time_Data = BSP_I2C_RTC_Read(SECONDSREG);

  	Calendar.Second = BCDToHex(Time_Data & 0x7f); //秒
  
    Time_Data = BSP_I2C_RTC_Read(MINUTESREG);
	
   	Calendar.Minute= BCDToHex(Time_Data & 0x7f); //分

    Time_Data = BSP_I2C_RTC_Read(HOURSREG);
	
	Calendar.Hour = BCDToHex(Time_Data & 0x3f); //时
	
 	Time_Data = BSP_I2C_RTC_Read(DAYSREG);

  	Calendar.Day = BCDToHex(Time_Data & 0x3f); //日
  
    Time_Data = BSP_I2C_RTC_Read(WEEKDAYSREG);
	
   	Calendar.Week = BCDToHex(Time_Data & 0x07); //星期

    Time_Data = BSP_I2C_RTC_Read(MONTHSREG);	
	
   	Calendar.Month = BCDToHex(Time_Data & 0x1f); //月

    Time_Data = BSP_I2C_RTC_Read(YEARSREG);
	
	Calendar.Year.half.lbyte = BCDToHex(Time_Data & 0xff); //年
  
}


/*===========================================================================*
 函数名称：void BSP_RTC_Init(void)
 功能描述：初始化时钟芯片PCF8563
 输入参数：无
 返回值：无
 使用说明：
 *==========================================================================*/
void BSP_RTC_Init(void)
{	
/*
	Calendar.Second = 0x00;
	Calendar.Minute = 0x36;
	Calendar.Hour = 0x0E;
	Calendar.Day = 0x05;
	Calendar.Month = 0x02;
	Calendar.Year.half.lbyte = 0x12;
	Calendar.Year.half.hbyte = 0x14;

*/
	BSP_I2C_RTC_Write(SECONDSREG, HexToBCD(Calendar.Second));	//秒
	BSP_I2C_RTC_Write(MINUTESREG, HexToBCD(Calendar.Minute));	//分
	BSP_I2C_RTC_Write(HOURSREG, HexToBCD(Calendar.Hour));	//时
	BSP_I2C_RTC_Write(DAYSREG, HexToBCD(Calendar.Day));		//日
	BSP_I2C_RTC_Write(WEEKDAYSREG, HexToBCD(Calendar.Week));//星期
	BSP_I2C_RTC_Write(MONTHSREG, HexToBCD(Calendar.Month));	//月
	BSP_I2C_RTC_Write(YEARSREG, HexToBCD(Calendar.Year.half.lbyte));	//年

	BSP_I2C_RTC_Write(TIMERCTLREG, 0x03);				//定时器未使用，省电模式
	BSP_I2C_RTC_Write(CTLSTATUS2REG, 0x0C);				//告警和定时器标志使能

	vStartRTC();									//时钟开启
}

/***************************************************************************
函数名称:void WriteRTCTime(_CALENDAR m_st_Calendar)
功能描述:将日期和时间写入时钟芯片PCF8563
输入参数：_CALENDAR m_st_Calendar
返回值：无
使用说明：
****************************************************************************/

void WriteRTCTime(_CALENDAR m_st_Calendar)
{
	BSP_I2C_RTC_Write(SECONDSREG, HexToBCD(m_st_Calendar.Second));	//秒
	BSP_I2C_RTC_Write(MINUTESREG, HexToBCD(m_st_Calendar.Minute));	//分
	BSP_I2C_RTC_Write(HOURSREG, HexToBCD(m_st_Calendar.Hour));	//时
	BSP_I2C_RTC_Write(DAYSREG, HexToBCD(m_st_Calendar.Day));		//日
//	BSP_I2C_RTC_Write(WEEKDAYSREG, m_st_Calendar.Week);	//星期
	BSP_I2C_RTC_Write(MONTHSREG, HexToBCD(m_st_Calendar.Month));	//月
	BSP_I2C_RTC_Write(YEARSREG, HexToBCD(m_st_Calendar.Year.half.lbyte ));	//年
 /* 
	BSP_I2C_RTC_Write(TIMERCTLREG, 0x03);					//定时器无效
	BSP_I2C_RTC_Write(CTLSTATUS2REG, 0x0C);

	vStartRTC();									//时钟开启
*/
}

